---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotEnoughRoomForFittingsWarning
source: html/4307b04a-e71c-dee4-5350-10f7ae1a377d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotEnoughRoomForFittingsWarning Property

There was not enough room to place the required fittings. Consider increasing the length of the segments,
 or moving them farther apart to generate a solution.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotEnoughRoomForFittingsWarning { get; }
```